{"base_model_name_or_path": "./PTM/Llama-3.2-1B-Instruct", "bias": "none", "fan_in_fan_out": false, "inference_mode": true, "init_lora_weights": true, "lora_alpha": 32, "lora_dropout": 0.1, "modules_to_save": null, "peft_type": "LORA", "r": 8, "r_sum": 0, "save_loranew": false, "target_modules": ["q_proj", "v_proj"], "task_type": "CAUSAL_LM"}